# Brewfile
#
# Installs important tools.
#

tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-fonts"

# Required for mac apps
brew "mas"

# CLI apps
## Text editor
brew "neovim"
## General tools
brew "gh"
brew "lazygit"
brew "tree"
brew "neofetch"
brew "gnupg"
brew "pinentry-mac"
brew "tmux"
brew "asciinema"
brew "zoxide"
brew "fzf"
## Installers/version managers
brew "nvm"
brew "pyenv"
brew "rustup-init"
brew "juliaup"
brew "haskell-stack"
# brew "deno" # deno updates itself. TODO: Find another way to install deno on initial setup.
## Gimmicks
brew "cmatrix"
brew "cowsay"
brew "fortune"
brew "rogue"

# Applications
## Cask
cask "alacritty"
cask "monitorcontrol"
cask "multimc"
cask "mactex"
cask "bartender"
## Mas
mas "Xcode", id: 497799835
mas "Pixelmator Pro", id: 1289583905

# Fonts
## Monospace
cask "font-fira-code-nerd-font"
cask "font-fira-code"
cask "font-fira-mono"

